GopalSaraf/Practicals/PSDL/include/proc/pic16f526.inc
// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 000Ah
// bitfield definitions
ADRES_ADRES_POSN                         equ 0000h
ADRES_ADRES_POSITION                     equ 0000h
ADRES_ADRES_SIZE                         equ 0008h
ADRES_ADRES_LENGTH                       equ 0008h
ADRES_ADRES_MASK                         equ 00FFh
ADRES_ADRES0_POSN                        equ 0000h
ADRES_ADRES0_POSITION                    equ 0000h
ADRES_ADRES0_SIZE                        equ 0001h
ADRES_ADRES0_LENGTH                      equ 0001h
ADRES_ADRES0_MASK                        equ 0001h
ADRES_ADRES1_POSN                        equ 0001h
ADRES_ADRES1_POSITION                    equ 0001h
ADRES_ADRES1_SIZE                        equ 0001h
ADRES_ADRES1_LENGTH                      equ 0001h
ADRES_ADRES1_MASK                        equ 0002h
ADRES_ADRES2_POSN                        equ 0002h
ADRES_ADRES2_POSITION                    equ 0002h
ADRES_ADRES2_SIZE                        equ 0001h
ADRES_ADRES2_LENGTH                      equ 0001h
ADRES_ADRES2_MASK                        equ 0004h
ADRES_ADRES3_POSN                        equ 0003h
ADRES_ADRES3_POSITION                    equ 0003h
ADRES_ADRES3_SIZE                        equ 0001h
ADRES_ADRES3_LENGTH                      equ 0001h
ADRES_ADRES3_MASK                        equ 0008h
ADRES_ADRES4_POSN                        equ 0004h
ADRES_ADRES4_POSITION                    equ 0004h
ADRES_ADRES4_SIZE                        equ 0001h
ADRES_ADRES4_LENGTH                      equ 0001h
ADRES_ADRES4_MASK                        equ 0010h
ADRES_ADRES5_POSN                        equ 0005h
ADRES_ADRES5_POSITION                    equ 0005h
ADRES_ADRES5_SIZE                        equ 0001h
ADRES_ADRES5_LENGTH                      equ 0001h
ADRES_ADRES5_MASK                        equ 0020h
ADRES_ADRES6_POSN                        equ 0006h
ADRES_ADRES6_POSITION                    equ 0006h
ADRES_ADRES6_SIZE                        equ 0001h
ADRES_ADRES6_LENGTH                      equ 0001h
ADRES_ADRES6_MASK                        equ 0040h
ADRES_ADRES7_POSN                        equ 0007h
ADRES_ADRES7_POSITION                    equ 0007h
ADRES_ADRES7_SIZE                        equ 0001h
ADRES_ADRES7_LENGTH                      equ 0001h
ADRES_ADRES7_MASK                        equ 0080h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 000Bh
// bitfield definitions
CM2CON0_nC2WU_POSN                       equ 0000h
CM2CON0_nC2WU_POSITION                   equ 0000h
CM2CON0_nC2WU_SIZE                       equ 0001h
CM2CON0_nC2WU_LENGTH                     equ 0001h
CM2CON0_nC2WU_MASK                       equ 0001h
CM2CON0_C2PREF1_POSN                     equ 0001h
CM2CON0_C2PREF1_POSITION                 equ 0001h
CM2CON0_C2PREF1_SIZE                     equ 0001h
CM2CON0_C2PREF1_LENGTH                   equ 0001h
CM2CON0_C2PREF1_MASK                     equ 0002h
CM2CON0_C2NREF_POSN                      equ 0002h
CM2CON0_C2NREF_POSITION                  equ 0002h
CM2CON0_C2NREF_SIZE                      equ 0001h
CM2CON0_C2NREF_LENGTH                    equ 0001h
CM2CON0_C2NREF_MASK                      equ 0004h
CM2CON0_C2ON_POSN                        equ 0003h
CM2CON0_C2ON_POSITION                    equ 0003h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0008h
CM2CON0_C2PREF2_POSN                     equ 0004h
CM2CON0_C2PREF2_POSITION                 equ 0004h
CM2CON0_C2PREF2_SIZE                     equ 0001h
CM2CON0_C2PREF2_LENGTH                   equ 0001h
CM2CON0_C2PREF2_MASK                     equ 0010h
CM2CON0_C2POL_POSN                       equ 0005h
CM2CON0_C2POL_POSITION                   equ 0005h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0020h
CM2CON0_nC2OUTEN_POSN                    equ 0006h
CM2CON0_nC2OUTEN_POSITION                equ 0006h
CM2CON0_nC2OUTEN_SIZE                    equ 0001h
CM2CON0_nC2OUTEN_LENGTH                  equ 0001h
CM2CON0_nC2OUTEN_MASK                    equ 0040h
CM2CON0_C2OUT_POSN                       equ 0007h
CM2CON0_C2OUT_POSITION                   equ 0007h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0080h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 000Ch
// bitfield definitions
VRCON_VR_POSN                            equ 0000h
VRCON_VR_POSITION                        equ 0000h
VRCON_VR_SIZE                            equ 0004h
VRCON_VR_LENGTH                          equ 0004h
VRCON_VR_MASK                            equ 000Fh
VRCON_VRR_POSN                           equ 0005h
VRCON_VRR_POSITION                       equ 0005h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0020h
VRCON_VROE_POSN                          equ 0006h
VRCON_VROE_POSITION                      equ 0006h
VRCON_VROE_SIZE                          equ 0001h
VRCON_VROE_LENGTH                        equ 0001h
VRCON_VROE_MASK                          equ 0040h
VRCON_VREN_POSN                          equ 0007h
VRCON_VREN_POSITION                      equ 0007h
VRCON_VREN_SIZE                          equ 0001h
VRCON_VREN_LENGTH                        equ 0001h
VRCON_VREN_MASK                          equ 0080h
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h

// Register: EECON
#define EECON EECON
EECON                                    equ 0021h
// bitfield definitions
EECON_RD_POSN                            equ 0000h
EECON_RD_POSITION                        equ 0000h
EECON_RD_SIZE                            equ 0001h
EECON_RD_LENGTH                          equ 0001h
EECON_RD_MASK                            equ 0001h
EECON_WR_POSN                            equ 0001h
EECON_WR_POSITION                        equ 0001h
EECON_WR_SIZE                            equ 0001h
EECON_WR_LENGTH                          equ 0001h
EECON_WR_MASK                            equ 0002h
EECON_WREN_POSN                          equ 0002h
EECON_WREN_POSITION                      equ 0002h
EECON_WREN_SIZE                          equ 0001h
EECON_WREN_LENGTH                        equ 0001h
EECON_WREN_MASK                          equ 0004h
EECON_WRERR_POSN                         equ 0003h
EECON_WRERR_POSITION                     equ 0003h
EECON_WRERR_SIZE                         equ 0001h
EECON_WRERR_LENGTH                       equ 0001h
EECON_WRERR_MASK                         equ 0008h
EECON_FREE_POSN                          equ 0004h
EECON_FREE_POSITION                      equ 0004h
EECON_FREE_SIZE                          equ 0001h
EECON_FREE_LENGTH                        equ 0001h
EECON_FREE_MASK                          equ 0010h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 0025h
// bitfield definitions
EEDATA_EEDATA_POSN                       equ 0000h
EEDATA_EEDATA_POSITION                   equ 0000h
EEDATA_EEDATA_SIZE                       equ 0008h
EEDATA_EEDATA_LENGTH                     equ 0008h
EEDATA_EEDATA_MASK                       equ 00FFh

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 0026h
// bitfield definitions
EEADR_EEADR_POSN                         equ 0000h
EEADR_EEADR_POSITION                     equ 0000h
EEADR_EEADR_SIZE                         equ 0008h
EEADR_EEADR_LENGTH                       equ 0008h
EEADR_EEADR_MASK                         equ 00FFh

// Register: TRISB
#define TRISB TRISB

// Register: TRISC
#define TRISC TRISC

